react-project-backend/app/models/account.rb

SELECT 1 AS one FROM "accounts" WHERE "accounts"."acct_number" = ? LIMIT ?  [["acct_number", 883244], ["LIMIT", 1]]
---
    def account_number_generator
        acct_num = rand(111111..999999)

        while Account.exists?(acct_number: acct_num)