react-project-backend/app/controllers/api/v1/accounts_controller.rb

    def create
        account = @user.accounts.build(account_params)
        if account.save
---
INSERT INTO "accounts" ("acct_number", "acct_type", "balance", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["acct_number", 298672], ["acct_type", "checkin"], ["balance", 50.0], ["user_id", 1], ["created_at", "2020-06-18 18:26:26.631977"], ["updated_at", "2020-06-18 18:26:26.631977"]]

    def show
        account = @user.accounts.find_by(id: params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? AND "accounts"."id" = ? LIMIT ?  [["user_id", 1], ["id", nil], ["LIMIT", 1]]

    def set_user
        @useer = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]