react-project-backend/app/controllers/api/v1/transactions_controller.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."account_id" = ?  [["account_id", 1]]
---
    def show
        transaction = @account.transactions.find_by(id: params[:id])

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_account
        @account = Account.find(params[:account_id])